org/emacs-org-mode.org
#+title: Emacs Org Mode
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+author: NyllRE

* Org Essentials
** Make an Emacs Org GUIDE
SCHEDULED: <2022-08-08 Mon 8:00>
- SPC-m-t-# marks a section's status (TODO, DONE, PROJ, etc)
- SPC-m-d-s opens org-schedule for a section
- RET => toggle TODO & DONE

** PROJ Task Counters => [1/5] [20%]
+ [ ] CTRL + RET => add new item
+ [X] C-c C-c or SPC-m-x => toggle Box
+ [ ] add [ / ] 'no spaces' to the head => automatically adds [0/X]
+ [ ] [ % ] for percentages
+ [-] and considering grouped tasks...
  + [-] you can do them easily
  + [ ] when they're finished the counter above gets toggled

** Org Agenda `SPC-o-A`
: the agenda collects all of the todo's you have and sorts them in multiple ways
- a = agenda for current week (what you scheduled)
- t = todo items not done
  + t => toggle state

- s = search by keyword
  + you can use regex!

** PROJ SPC-X for Capture Mode
- j => Journal
- n => notes
- t => to-do's
- p => local
  + to-do's
  + notes
  + change-log

** PROJ C-c C-e for exporting
- m m => markdown
- h h => html
