org/emacs-org-mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-09 Tue 19:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Org Mode</title>
<meta name="author" content="NyllRE" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs Org Mode</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2469df2">1. Org Essentials</a>
<ul>
<li><a href="#org178c701">1.1. Make an Emacs Org GUIDE</a></li>
<li><a href="#org5972265">1.2. <span class="todo PROJ">PROJ</span> Task Counters =&gt; <code>[1/5]</code> <code>[20%]</code></a></li>
<li><a href="#org3932712">1.3. Org Agenda `SPC-o-A`</a></li>
<li><a href="#org7090517">1.4. <span class="todo PROJ">PROJ</span> SPC-X for Capture Mode</a></li>
<li><a href="#orgce17a48">1.5. <span class="todo PROJ">PROJ</span> C-c C-e for exporting</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2469df2" class="outline-2">
<h2 id="org2469df2"><span class="section-number-2">1.</span> Org Essentials</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org178c701" class="outline-3">
<h3 id="org178c701"><span class="section-number-3">1.1.</span> Make an Emacs Org GUIDE</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>SPC-m-t-# marks a section&rsquo;s status (TODO, DONE, PROJ, etc)</li>
<li>SPC-m-d-s opens org-schedule for a section</li>
<li>RET =&gt; toggle TODO &amp; DONE</li>
</ul>
</div>
</div>

<div id="outline-container-org5972265" class="outline-3">
<h3 id="org5972265"><span class="section-number-3">1.2.</span> <span class="todo PROJ">PROJ</span> Task Counters =&gt; <code>[1/5]</code> <code>[20%]</code></h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> CTRL + RET =&gt; add new item</li>
<li class="on"><code>[X]</code> C-c C-c or SPC-m-x =&gt; toggle Box</li>
<li class="off"><code>[&#xa0;]</code> add [ / ] &rsquo;no spaces&rsquo; to the head =&gt; automatically adds [0/X]</li>
<li class="off"><code>[&#xa0;]</code> [ % ] for percentages</li>
<li class="trans"><code>[-]</code> and considering grouped tasks&#x2026;
<ul class="org-ul">
<li class="trans"><code>[-]</code> you can do them easily</li>
<li class="off"><code>[&#xa0;]</code> when they&rsquo;re finished the counter above gets toggled</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org3932712" class="outline-3">
<h3 id="org3932712"><span class="section-number-3">1.3.</span> Org Agenda `SPC-o-A`</h3>
<div class="outline-text-3" id="text-1-3">
<pre class="example">
the agenda collects all of the todo's you have and sorts them in multiple ways
</pre>

<ul class="org-ul">
<li>a = agenda for current week (what you scheduled)</li>
<li>t = todo items not done
<ul class="org-ul">
<li>t =&gt; toggle state</li>
</ul></li>

<li>s = search by keyword
<ul class="org-ul">
<li>you can use regex!</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org7090517" class="outline-3">
<h3 id="org7090517"><span class="section-number-3">1.4.</span> <span class="todo PROJ">PROJ</span> SPC-X for Capture Mode</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>j =&gt; Journal</li>
<li>n =&gt; notes</li>
<li>t =&gt; to-do&rsquo;s</li>
<li>p =&gt; local
<ul class="org-ul">
<li>to-do&rsquo;s</li>
<li>notes</li>
<li>change-log</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgce17a48" class="outline-3">
<h3 id="orgce17a48"><span class="section-number-3">1.5.</span> <span class="todo PROJ">PROJ</span> C-c C-e for exporting</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>m m =&gt; markdown</li>
<li>h h =&gt; html</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: NyllRE</p>
<p class="date">Created: 2022-08-09 Tue 19:29</p>
</div>
</body>
</html>
